---
kind: method
id: M:Autodesk.Revit.DB.FormulaManager.Dispose
source: html/f73a30e6-08b9-5d37-6030-de9cddfeff33.htm
---
# Autodesk.Revit.DB.FormulaManager.Dispose Method

Releases all resources used by the FormulaManager

## Syntax (C#)
```csharp
public void Dispose()
```